Repository: Daniel-KM/Omeka-S-module-BotChallenge
Catalog: language/*.po
Languages: fr

source: Verifying your browser
fr: Vérification du navigateur

source: JavaScript required
fr: JavaScript requis

source: Please enable JavaScript in your browser to access this site.
fr: Veuillez activer JavaScript dans votre navigateur pour accéder à ce site.

source: Verifying your browser…
fr: Vérification du navigateur…

source: This is an automatic process. Please wait.
fr: Il s’agit d’un processus automatique. Veuillez patienter.

source: Powered by %s
fr: Propulsé par %s

source: Automated browser detected. Access denied.
fr: Navigateur automatisé détecté. Accès refusé.

source: Verified. Redirecting…
fr: Vérifié. Redirection…

source: HMAC salt
fr: Sel HMAC

source: Secret salt used to generate challenge tokens. Leave empty to regenerate automatically. Changing this value invalidates all existing cookies.
fr: Sel secret utilisé pour créer des jetons de défi. Laisser vide pour le régénérer automatiquement. La modification de cette valeur invalide tous les cookies existants.

source: Challenge delay (seconds)
fr: Délai du défi (secondes)

source: Number of seconds the visitor must wait before the cookie is set.
fr: Nombre de secondes à attendre pour le visiteur vant de placer le cookie.

source: Cookie lifetime (days)
fr: Durée de vie des cookies (jours)

source: Number of days the challenge cookie remains valid.
fr: Nombre de jours pendant lesquels le cookie reste valide.

source: Detect headless browsers
fr: Détecter les navigateurs sans tête

source: Run additional tests to detect headless browsers (Selenium, PhantomJS, Puppeteer, etc.).
fr: Exécuter des tests supplémentaires pour détecter les navigateurs sans tête (Selenium, PhantomJS, Puppeteer, etc.).

source: Exception paths
fr: Exceptions pour les chemins

source: Url path prefixes to exclude from the challenge, one per line. Example: /api
fr: Préfixes de chemins d’url à exclure du défi, un par ligne. Exemple : /api

source: Exception IPs
fr: Exceptions pour les ips

source: Ips v4 or v6 or cidr ranges to exclude from the challenge, one per line.
fr: Plages ips v4 ou v6 ou cidr à exclure du défi, une par ligne.
